Tekla Open API Reference for Tekla Structures 2025
GraphicsDrawer.DrawMeshSurface Method
 Draws the mesh surface as temporary graphics in the currently active Tekla Structures rendered view. The counterclockwise sides of the mesh triangles are drawn.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool DrawMeshSurface(
	Mesh Mesh,
	Color Color
)
Public Function DrawMeshSurface (
	Mesh As Mesh,
	Color As Color
) As Boolean
Parameters
Mesh
Type: Tekla.Structures.Model.UI.Mesh
The mesh to draw.
Color
Type: Tekla.Structures.Model.UI.Color
The color of the mesh.
Return Value
Type: Boolean
True on success.
See Also
Reference
GraphicsDrawer Class
Tekla.Structures.Model.UI Namespace